#
# class ReceiveDataFromNode:
#     def __init__(self):
#         pass
#
#     def process(self):
#         """
#         Обрабатывает полученные от ноды данные.
#         Сейчас это данные с датчиков.
#         Позже юзкейсы будут разделяться в зависимости от типа данных и оснащения нод.
#         Например:
#           - включение света,
#           - срабатываение датчика,
#           - триггер на ноде
#           - и тп
#         """
#         # Сохранить текущие значения в базу
#         # Сохранить историю в базу
#         # Отправить уведомление пользователям
#         pass
